In [1]:
import numpy as np
import pandas as pd

In [2]:
titc = pd.read_csv('./data/titanic.csv') 
titc

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

- 기초문제
1. 전체 승객 중 생존자의 수와 사망자의 수를 구하여 출력
2. 승객 나이의 평균 출력
3. 1등급 승객 중 운임이 가장 높은 승객의 이름 출력
4. 여성 승객의 수를 구하여 출력
5. 운임이 50 이상인 승객의 이름과 운임 출력
6. 나이가 18세 미만인 승객들의 생존율을 계산하여 출력
7. 2등급 객실에 탑승한 승객의 평균 운임을 계산하여 출력
8. 승객 중 나이가 가장 많은 사람의 나이와 이름을 출력
9. S 항구에서 탑승한 승객의 수를 출력
10. 3등급 객실에 탑승한 남성 승객 중 생존자의 수를 출력

In [ ]:
# 1. 전체 승객 중 생존자의 수와 사망자의 수를 구하여 출력
titc_sur = pd.DataFrame(titc['Survived'])
titc_sur
print(titc_sur[titc_sur['Survived'] == 1].count()) # 생존자 수
print(titc_sur[titc_sur['Survived'] == 0].count()) # 사망자 수

Survived    342
dtype: int64
Survived    549
dtype: int64

In [ ]:
# 2. 승객 나이의 평균 출력
titc_age = titc['Age']
titc_age.mean()

np.float64(29.69911764705882)

In [19]:
# 3. 1등급 승객 중 운임이 가장 높은 승객의 이름 출력
titc[titc['Pclass'] == 1].sort_values('Fare', ascending=False).iloc[0]['Name']

'Ward, Miss. Anna'

In [21]:
# 4. 여성 승객의 수를 구하여 출력
len(titc[titc['Sex'] == 'female'])

314

In [22]:
# 5. 운임이 50 이상인 승객의 이름과 운임 출력
titc5 = titc[titc['Fare'] >= 50]
titc5[['Name', 'Fare']]

                                                  Name      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   53.1000
6                              McCarthy, Mr. Timothy J   51.8625
27                      Fortune, Mr. Charles Alexander  263.0000
31      Spencer, Mrs. William Augustus (Marie Eugenie)  146.5208
..                                                 ...       ...
856         Wick, Mrs. George Dennick (Mary Hitchcock)  164.8667
863                  Sage, Miss. Dorothy Edith "Dolly"   69.5500
867               Roebling, Mr. Washington Augustus II   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)   83.1583

[161 rows x 2 columns]

In [26]:
# 6. 나이가 18세 미만인 승객들의 생존율을 계산하여 출력
titc6 = titc[titc['Age'] < 18]
len(titc6[titc6['Survived'] == 1]) / len(titc6) * 100

53.98230088495575

In [27]:
# 7. 2등급 객실에 탑승한 승객의 평균 운임을 계산하여 출력
titc7 = titc[titc['Pclass'] == 2]
titc7['Fare'].mean()

np.float64(20.662183152173913)

In [37]:
# 8. 승객 중 나이가 가장 많은 사람의 나이와 이름을 출력
titc.sort_values('Age', ascending=False).iloc[0][['Age', 'Name']]

Age                                     80.0
Name    Barkworth, Mr. Algernon Henry Wilson
Name: 630, dtype: object

In [39]:
# 9. S 항구에서 탑승한 승객의 수를 출력
len(titc[titc['Embarked'] == 'S'])

644

In [40]:
# 10. 3등급 객실에 탑승한 남성 승객 중 생존자의 수를 출력
titc10 = titc[titc['Pclass'] == 3]
titc10_1 = titc10[titc10['Sex'] == 'male']
len(titc10_1[titc10_1['Survived'] == 1])

47

### 고급 문제

In [43]:
# 1. 생존자(Survived)와 그렇지 않은 사람들의 `Pclass`(객실 등급)별 평균 나이를 각각 출력
result = titc.groupby(['Survived', 'Pclass'])['Age'].mean().reset_index()
print(result)

   Survived  Pclass        Age
0         0       1  43.695312
1         0       2  33.544444
2         0       3  26.555556
3         1       1  35.368197
4         1       2  25.901566
5         1       3  20.646118